In [2]:
import pandas as pd

In [7]:
df=pd.read_csv("data.csv",index_col=0)

In [14]:
a=df.head(10)
a

        Physics  Maths  Chemistry  Biology  Computer Science
Mohit        16     16         18       15                14
Ravi         12     16         14       13                12
Raju         11     15         16       16                17
Jayant       14     16         10       11                18
Akash        10     14         15       15                11

In [15]:
type(a)

pandas.core.frame.DataFrame

In [16]:
df.tail(2)

        Physics  Maths  Chemistry  Biology  Computer Science
Jayant       14     16         10       11                18
Akash        10     14         15       15                11

In [23]:
df.iloc[::-1,::-1]

        Computer Science  Biology  Chemistry  Maths  Physics
Akash                 11       15         15     14       10
Jayant                18       11         10     16       14
Raju                  17       16         16     15       11
Ravi                  12       13         14     16       12
Mohit                 14       15         18     16       16

In [28]:
df.iloc[1:,1:]# TO extract Range from table

        Maths  Chemistry  Biology  Computer Science
Ravi       16         14       13                12
Raju       15         16       16                17
Jayant     16         10       11                18
Akash      14         15       15                11

In [29]:
df.iat[1,1]#To Extract An Element from table

16

In [31]:
c=df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Mohit to Akash
Data columns (total 5 columns):
Physics             5 non-null int64
Maths               5 non-null int64
Chemistry           5 non-null int64
Biology             5 non-null int64
Computer Science    5 non-null int64
dtypes: int64(5)
memory usage: 400.0+ bytes

In [33]:
print(c)

None

In [34]:
df.describe()

         Physics      Maths  Chemistry  Biology  Computer Science
count   5.000000   5.000000   5.000000      5.0           5.00000
mean   12.600000  15.400000  14.600000     14.0          14.40000
std     2.408319   0.894427   2.966479      2.0           3.04959
min    10.000000  14.000000  10.000000     11.0          11.00000
25%    11.000000  15.000000  14.000000     13.0          12.00000
50%    12.000000  16.000000  15.000000     15.0          14.00000
75%    14.000000  16.000000  16.000000     15.0          17.00000
max    16.000000  16.000000  18.000000     16.0          18.00000

In [38]:
type(df.dtypes)

pandas.core.series.Series

In [39]:
df.dtypes

Physics             int64
Maths               int64
Chemistry           int64
Biology             int64
Computer Science    int64
dtype: object

In [40]:
df.index

Index(['Mohit', 'Ravi', 'Raju', 'Jayant', 'Akash'], dtype='object')

In [42]:
df.columns

Index(['Physics', 'Maths', 'Chemistry', 'Biology', 'Computer Science'], dtype='object')

In [43]:
df.T

                  Mohit  Ravi  Raju  Jayant  Akash
Physics              16    12    11      14     10
Maths                16    16    15      16     14
Chemistry            18    14    16      10     15
Biology              15    13    16      11     15
Computer Science     14    12    17      18     11

In [44]:
df.values

array([[16, 16, 18, 15, 14],
       [12, 16, 14, 13, 12],
       [11, 15, 16, 16, 17],
       [14, 16, 10, 11, 18],
       [10, 14, 15, 15, 11]], dtype=int64)

In [61]:
sortByIndex=df.sort_index(axis=0)

In [62]:
print(sortByIndex)

        Physics  Maths  Chemistry  Biology  Computer Science
Akash        10     14         15       15                11
Jayant       14     16         10       11                18
Mohit        16     16         18       15                14
Raju         11     15         16       16                17
Ravi         12     16         14       13                12

In [73]:
sortByValue=df.sort_values("Biology")

In [74]:
print(sortByValue)

        Physics  Maths  Chemistry  Biology  Computer Science
Jayant       14     16         10       11                18
Ravi         12     16         14       13                12
Mohit        16     16         18       15                14
Akash        10     14         15       15                11
Raju         11     15         16       16                17

In [76]:
df.sort_values("Computer Science",ascending=False)

        Physics  Maths  Chemistry  Biology  Computer Science
Jayant       14     16         10       11                18
Raju         11     15         16       16                17
Mohit        16     16         18       15                14
Ravi         12     16         14       13                12
Akash        10     14         15       15                11

In [82]:
df.sort_values(["Ravi","Mohit"],axis=1,ascending=[True,False])

        Physics  Computer Science  Biology  Chemistry  Maths
Mohit        16                14       15         18     16
Ravi         12                12       13         14     16
Raju         11                17       16         16     15
Jayant       14                18       11         10     16
Akash        10                11       15         15     14

In [83]:
df[["Chemistry","Maths"]]

        Chemistry  Maths
Mohit          18     16
Ravi           14     16
Raju           16     15
Jayant         10     16
Akash          15     14

In [84]:
df.columns

Index(['Physics', 'Maths', 'Chemistry', 'Biology', 'Computer Science'], dtype='object')

In [89]:
df.drop(["Akash","Mohit"],axis=0)

        Physics  Maths  Chemistry  Biology  Computer Science
Ravi         12     16         14       13                12
Raju         11     15         16       16                17
Jayant       14     16         10       11                18

In [96]:
df.loc[["Mohit","Raju"],["Physics","Biology"]]

       Physics  Biology
Mohit       16       15
Raju        11       16

In [99]:
df.loc[df.index>="Mohit"]

       Physics  Maths  Chemistry  Biology  Computer Science
Mohit       16     16         18       15                14
Ravi        12     16         14       13                12
Raju        11     15         16       16                17

In [100]:
df.index>="Jayant"

array([ True,  True,  True,  True, False])

In [118]:
df.loc[(df["Chemistry"]>10) & (df["Biology"]>12)]

       Physics  Maths  Chemistry  Biology  Computer Science
Mohit       16     16         18       15                14
Ravi        12     16         14       13                12
Raju        11     15         16       16                17
Akash       10     14         15       15                11

In [120]:
df.groupby("Chemistry").mean()

           Physics  Maths  Biology  Computer Science
Chemistry
10              14     16       11                18
14              12     16       13                12
15              10     14       15                11
16              11     15       16                17
18              16     16       15                14

In [121]:
df.groupby("Chemistry").std()

           Physics  Maths  Biology  Computer Science
Chemistry
10             NaN    NaN      NaN               NaN
14             NaN    NaN      NaN               NaN
15             NaN    NaN      NaN               NaN
16             NaN    NaN      NaN               NaN
18             NaN    NaN      NaN               NaN

In [122]:
df.groupby("Chemistry").median()

           Physics  Maths  Biology  Computer Science
Chemistry
10              14     16       11                18
14              12     16       13                12
15              10     14       15                11
16              11     15       16                17
18              16     16       15                14

In [126]:
import numpy as np
df.iloc[:1,3:]=np.NaN

In [127]:
df

        Physics  Maths  Chemistry  Biology  Computer Science
Mohit        16     16         18      NaN               NaN
Ravi         12     16         14     13.0              12.0
Raju         11     15         16     16.0              17.0
Jayant       14     16         10     11.0              18.0
Akash        10     14         15     15.0              11.0

In [129]:
df.isna()

        Physics  Maths  Chemistry  Biology  Computer Science
Mohit     False  False      False     True              True
Ravi      False  False      False    False             False
Raju      False  False      False    False             False
Jayant    False  False      False    False             False
Akash     False  False      False    False             False

In [132]:
df.dropna(axis=1)

        Physics  Maths  Chemistry
Mohit        16     16         18
Ravi         12     16         14
Raju         11     15         16
Jayant       14     16         10
Akash        10     14         15

In [139]:
df.dropna(how="any",thresh=4,axis=1) #Thresh Not  Nan

        Physics  Maths  Chemistry  Biology  Computer Science
Mohit        16     16         18      NaN               NaN
Ravi         12     16         14     13.0              12.0
Raju         11     15         16     16.0              17.0
Jayant       14     16         10     11.0              18.0
Akash        10     14         15     15.0              11.0